# SchemaGuid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExtensibleStorageFilter..::..SchemaGuid Property
ExtensibleStorageFilter Class See Also
---
Schema id used to filter elements with extensible storage data
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Guid SchemaGuid { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SchemaGuid As Guid
	Get
```

Visual C++
---
```text
public:
property Guid SchemaGuid {
	Guid get ();
}
```

# See Also
ExtensibleStorageFilter Class
Autodesk.Revit.DB.ExtensibleStorage Namespace